In [185]:
import pandas as pd
import numpy as np
import sqlalchemy

In [186]:
# Csv file was uploaded to amazon aws rds mysql server as a database table
# Here, we use the connection string and user details to connect to the database
# In the following lines, we will look at the normalization operations done on the table. 

engine = sqlalchemy.create_engine('mysql://asharma:PatuKhola1@orchard.cvt6t7xaljhq.us-east-1.rds.amazonaws.com:3306')

In [187]:
existing_databases = engine.execute("SHOW DATABASES;")

In [188]:
existing_databases = [d[0] for d in existing_databases]

In [189]:
existing_databases

['information_schema',
 'innodb',
 'mysql',
 'orchard_schema_1',
 'performance_schema',
 'sys']

In [190]:
db= engine.execute("USE orchard_schema_1") # select database

In [20]:
# So far we created a connection to the aws database and saw the existing databases
# Now we are going to see the individual tables. 
# Can also write queries to create, modify tables.

In [191]:
query= """
select * from orchard_schema_1.NYC_rest_data_sample
limit 5
"""
original_table = pd.read_sql_query(query,engine)

In [192]:
# Print out the full original table for viewing 
original_table

,CAMIS,DBA,BORO,BUILDING,STREET,ZIPCODE,PHONE,CUISINE DESCRIPTION,INSPECTION DATE,ACTION,VIOLATION CODE,VIOLATION DESCRIPTION,CRITICAL FLAG,SCORE,GRADE,GRADE DATE,RECORD DATE,INSPECTION TYPE
0,40373938,IHOP,BRONX,5655,BROADWAY,10463,7185494565,American,08/16/2016,Violations were cited in the following area(s).,04L,Evidence of mice or live mice present in facil...,Critical,15,,,10/18/2016,Cycle Inspection / Initial Inspection
1,41217775,S. WAN CAFE,MANHATTAN,85,ELDRIDGE STREET,10002,2129668269,Chinese,09/25/2013,Violations were cited in the following area(s).,10F,Non-food contact surface improperly constructe...,Not Critical,17,,,10/18/2016,Cycle Inspection / Initial Inspection
2,40808056,FEI TENG BAKERY,BROOKLYN,4007,9 AVENUE,11232,7188715889,Bakery,07/17/2014,Violations were cited in the following area(s).,06C,Food not protected from potential source of co...,Critical,8,A,07/17/2014,10/18/2016,Cycle Inspection / Re-inspection
3,40585040,CAFE RAKKA,MANHATTAN,81,ST MARKS PLACE,10003,2129829166,Mediterranean,05/29/2014,Violations were cited in the following area(s).,08A,Facility not vermin proof. Harborage or condit...,Not Critical,11,A,05/29/2014,10/18/2016,Cycle Inspection / Re-inspection
4,40694764,MANNY'S GRILL,BROOKLYN,1089,GRAND STREET,11211,7184868225,American,08/09/2016,Violations were cited in the following area(s).,08A,Facility not vermin proof. Harborage or condit...,Not Critical,24,,,10/18/2016,Cycle Inspection / Initial Inspection

In [32]:
# The queries written below extract normalized tables from the main table. 
# There are four subtables:

# BUSINESSES TABLE-   details of each business
# INSPECTIONS TABLE-  details of each inspection on every business
# GRADES TABLE-       details of grade for each business
# VIOLATIONS TABLE-   violation codes and their descriptions

# For each table, primary and foreign key constraints are put in. 

# The dates are converted from text to date format for future consistency and proper comparison



query1 = """
create table Businesses AS
select
distinct CAMIS,
DBA,
BORO,
BUILDING,
STREET,
ZIPCODE,
PHONE,
`CUISINE DESCRIPTION` AS CUISINE_DESCRIPTION,
`RECORD DATE` AS RECORD_DATE
from NYC_rest_data_sample
"""
query2= """
alter table Businesses add Primary Key(CAMIS)
"""

query3 = """
create table `Violations` as
select
distinct `violation code` as violation_code,
`violation description` as violation_description
from NYC_rest_data_sample
"""
query4= """
alter table Violations alter column violation_code varchar(20)
alter table `Violations` add Primary Key (violation_code)
"""
query5 = """
create table Inspections_1 as
select
CAMIS,
cast(concat(substr(`inspection date`, 7,4),'-',substr(`inspection date`, 1,2),'-',substr(`inspection date`, 4,2)) as date) as inspect_date,
ACTION,
`VIOLATION CODE` as violation_code,
`CRITICAL FLAG` as critical_flag,
SCORE,
`INSPECTION TYPE` as inspection_type
from NYC_rest_data_sample
"""

# This table has a lot of duplicate entries- i.e. same business same day inspection details multiple times
# Therefore, create a new table out of this table by filtering out the duplicates

query5_1 = """

create table Inspections as 
select 
camis,
inspect_date,
action,
violation_code,
critical_flag,
score,
inspection_type,
count(camis)
from Inspections_1
group by inspect_date, camis

"""




query6= """
alter table Inspections add primary key (camis, inspect_date)
alter table Inspections ADD CONSTRAINT fk_CAMIS
FOREIGN KEY (CAMIS)
REFERENCES Businesses(CAMIS)
"""

query7 = """
create table Gradings_1 as
select
CAMIS,
cast(concat(substr(`grade date`, 7,4),'-',substr(`grade date`, 1,2),'-',substr(`grade date`, 4,2)) as date) as grade_date,
grade
from NYC_rest_data_sample
where `grade date` != ''
"""

# This table has a lot of duplicate entries- i.e. same business same day inspection details multiple times
# Therefore, create a new table out of this table by filtering out the duplicates

query7_1 = """
create table Gradings as
select
camis,
grade_date,
grade,
count(camis)
from Gradings_1
group by grade_date, camis
"""



query8= """
alter table Gradings add primary key (camis, grade_date)
alter table Gradings ADD CONSTRAINT fk_CAMIS
FOREIGN KEY (CAMIS)
REFERENCES Businesses(CAMIS)
"""

In [36]:
# Businesses table snapshot
query= """
select * from Businesses
limit 5
"""
businesses_table = pd.read_sql_query(query,engine)

In [37]:
businesses_table

,CAMIS,DBA,BORO,BUILDING,STREET,ZIPCODE,PHONE,CUISINE_DESCRIPTION,RECORD_DATE
0,40362715,THE COUNTRY CAFE,MANHATTAN,60,WALL STREET,10005,3474279132,Sandwiches/Salads/Mixed Buffet,10/18/2016
1,40363644,DOMINO'S,MANHATTAN,464,3 AVENUE,10016,2125450200,Pizza,10/18/2016
2,40365454,JOE & PAT'S PIZZERIA,STATEN ISLAND,1758,VICTORY BOULEVARD,10314,7189810887,Pizza/Italian,10/18/2016
3,40367677,CAPITOL RESTAURANT,MANHATTAN,4933,BROADWAY,10034,2129425090,American,10/18/2016
4,40369017,PALM TOO,MANHATTAN,840,2 AVENUE,10017,2126975198,American,10/18/2016

In [41]:
# Inspections table snapshot

query= """
select * from Inspections
limit 5
"""
inspections_table = pd.read_sql_query(query,engine)

In [42]:
inspections_table

,CAMIS,inspect_date,ACTION,violation_code,critical_flag,SCORE,inspection_type
0,40362715,2015-07-15,Violations were cited in the following area(s).,02B,Critical,19,Cycle Inspection / Initial Inspection
1,40362715,2016-09-06,Violations were cited in the following area(s).,06C,Critical,33,Cycle Inspection / Initial Inspection
2,40363644,2014-03-06,Violations were cited in the following area(s).,10B,Not Critical,11,Cycle Inspection / Re-inspection
3,40365454,2016-02-09,Violations were cited in the following area(s).,05D,Critical,26,Cycle Inspection / Initial Inspection
4,40367677,2016-09-29,Violations were cited in the following area(s).,08A,Not Critical,12,Cycle Inspection / Initial Inspection

In [45]:
# Gradings table snapshot

query= """
select * from Gradings
limit 5
"""
gradings_table = pd.read_sql_query(query,engine)

In [46]:
gradings_table

      CAMIS  grade_date grade
0  40363644  2014-03-06     A
1  40367677  2016-09-29     A
2  40376029  2013-03-22     A
3  40381720  2016-09-19     B
4  40386554  2014-07-15     A

In [179]:
# Violations table snapshot

query= """
select * from Violations
order by violation_code asc
limit 10
"""
violations_table = pd.read_sql_query(query,engine)

In [180]:
violations_table

  violation_code                              violation_description
0
1            02A   Food not cooked to required minimum temperature.
2            02B        Hot food item not held at or above 140?? F.
3            02C  Hot food item that has been cooked and refrige...
4            02G  Cold food item held above 41?? F (smoked fish ...
5            02H  Food not cooled by an approved method whereby ...
6            03A  Food from unapproved or unknown source or home...
7            03B  Shellfish not from approved source, improperly...
8            04A  Food Protection Certificate not held by superv...
9            04C  Food worker does not use proper utensil to eli...

In [195]:
# Get some of my friend's favorite places
# He likes places that have 
# an inspection score less than 10
# only a grade of A
# in recent gradings that are from 2016 and no earlier

query= """
select 
Businesses.CAMIS as CAMIS, 
Businesses.DBA as NAME,
Businesses.ZIPCODE,
Businesses.PHONE,
Businesses.CUISINE_DESCRIPTION,
Gradings.grade as Grade,
Gradings.grade_date as `Grade Date`
from 
Businesses left join
Inspections on Businesses.CAMIS = Inspections.CAMIS
left join Gradings on Businesses.CAMIS = Gradings.CAMIS
where Inspections.score<15 
&& Gradings.grade= 'A' 
&& Gradings.grade_date >'2015-12-31'
&& locate('thai', Businesses.CUISINE_DESCRIPTION)>0

order by Gradings.grade_date DESC
limit 10
"""
favorites_table = pd.read_sql_query(query,engine)

In [196]:
# A SAMPLE OF SOME PLACES THAT ARE LIKELY TO BE MY FRIEND'S FAVORITES
favorites_table

,CAMIS,NAME,ZIPCODE,PHONE,CUISINE_DESCRIPTION,Grade,Grade Date
0,41545732,LEMONGRASS GRILL,11201,7185229728,Thai,A,2016-10-13
1,41632888,RIDGEWOOD AUTHENTIC THAI KITCHEN,11385,7184187717,Thai,A,2016-10-11
2,41632888,RIDGEWOOD AUTHENTIC THAI KITCHEN,11385,7184187717,Thai,A,2016-10-11
3,41632888,RIDGEWOOD AUTHENTIC THAI KITCHEN,11385,7184187717,Thai,A,2016-10-11
4,50000055,BANKOK CUISINE,11375,7182614005,Thai,A,2016-10-11
5,41275701,TO BE THAI,11218,7184350459,Thai,A,2016-09-22
6,41275701,TO BE THAI,11218,7184350459,Thai,A,2016-09-22
7,41556098,UDOM THAI,11238,7186228424,Thai,A,2016-09-20
8,41556098,UDOM THAI,11238,7186228424,Thai,A,2016-09-20
9,50049845,THAI POCHANA,11374,7188971575,Thai,A,2016-09-12